app/controllers/books_controller.rb

  def home
    @books=Book.all
---
SELECT `books`.* FROM `books` ORDER BY created_at DESC

  def create
  	@book=Book.new(book_params)
  	if @book.save
---
INSERT INTO `books` (`title`, `publisher`, `isbn`, `publishing_date`, `created_at`, `updated_at`) VALUES ('fly', 'bird', 'qeww', '2001-05-20', '2017-09-25 17:23:12', '2017-09-25 17:23:12')

  def update
    @book=Book.find(params[:id])
    @authors=@book.authors.all
    if @book.update_attributes(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `authors`.* FROM `authors` WHERE `authors`.`book_id` = 1 AND `authors`.`id` IN (1, 2)
UPDATE `authors` SET `name` = 'gem1', `updated_at` = '2017-09-25 07:13:13' WHERE `authors`.`id` = 1
UPDATE `books` SET `title` = 'chicken', `publisher` = 'fady', `isbn` = 'fff', `publishing_date` = '2001-01-11' WHERE `books`.`id` = 60668565

  def destroy
    Book.find(params[:id]).destroy
---
DELETE FROM `books` WHERE `books`.`id` = 3
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1